# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArray..::..ForwardIterator Method
VertexIndexPairArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual VertexIndexPairArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As VertexIndexPairArrayIterator
```

Visual C++
---
```text
public:
virtual VertexIndexPairArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace